app/Models/ModelUser.php

    public function LoginUser($nama_user, $password){
        return $this->db->table('tbl_user')
            ->where([
                'nama_user' => $nama_user,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `nama_user` = 'pemilik'
AND `password` = '40bd001563085fc35165329ea1ff5c5ecbdbbeef'