app/Models/ModelLaporan.php

    public function DataHarian($tgl){
        return $this->db->table('tbl_rinci')
        ->where('tbl_rinci.tgl_jual', $tgl)
        ->select('tbl_rinci.kode_produk')
        ->select('tbl_rinci.nama_produk')
        ->select('tbl_rinci.nama_produk')
        ->select('tbl_rinci.qty')
        ->select('tbl_rinci.harga_jual')
        ->select('tbl_rinci.harga_beli')
        ->select('tbl_rinci.untung')
        ->select('tbl_rinci.total')
        ->groupBy('tbl_rinci.kode_produk')
        ->selectSum('tbl_rinci.qty')
        ->selectSum('tbl_rinci.untung')
        ->selectSum('tbl_rinci.total')
        ->get()
        ->getResultArray();
---
SELECT `tbl_rinci`.`kode_produk`, `tbl_rinci`.`nama_produk`, `tbl_rinci`.`nama_produk`, `tbl_rinci`.`qty`, `tbl_rinci`.`harga_jual`, `tbl_rinci`.`harga_beli`, `tbl_rinci`.`untung`, `tbl_rinci`.`total`, SUM(`tbl_rinci`.`qty`) AS `qty`, SUM(`tbl_rinci`.`untung`) AS `untung`, SUM(`tbl_rinci`.`total`) AS `total`
FROM `tbl_rinci`
WHERE `tbl_rinci`.`tgl_jual` = '2024-06-06'
GROUP BY `tbl_rinci`.`kode_produk`

    public function DataBulanan($bulan, $tahun){
        return $this->db->table('tbl_rinci')
        ->where('MONTH(tbl_rinci.tgl_jual)', $bulan)
        ->where('YEAR(tbl_rinci.tgl_jual)', $tahun)
        ->select('tbl_rinci.kode_produk')
        ->select('tbl_rinci.nama_produk')
        ->select('tbl_rinci.nama_produk')
        ->select('tbl_rinci.qty')
        ->select('tbl_rinci.harga_jual')
        ->select('tbl_rinci.harga_beli')
        ->select('tbl_rinci.untung')
        ->select('tbl_rinci.total')
        ->groupBy('tbl_rinci.kode_produk')
        ->selectSum('tbl_rinci.qty')
        ->selectSum('tbl_rinci.untung')
        ->selectSum('tbl_rinci.total')
                        ->get()
                        ->getResultArray();
---
SELECT `tbl_rinci`.`kode_produk`, `tbl_rinci`.`nama_produk`, `tbl_rinci`.`nama_produk`, `tbl_rinci`.`qty`, `tbl_rinci`.`harga_jual`, `tbl_rinci`.`harga_beli`, `tbl_rinci`.`untung`, `tbl_rinci`.`total`, SUM(`tbl_rinci`.`qty`) AS `qty`, SUM(`tbl_rinci`.`untung`) AS `untung`, SUM(`tbl_rinci`.`total`) AS `total`
FROM `tbl_rinci`
WHERE MONTH(tbl_rinci.tgl_jual) = '06'
AND YEAR(tbl_rinci.tgl_jual) = '2024'
GROUP BY `tbl_rinci`.`kode_produk`

    public function DataTahunan($tahun){
        return $this->db->table('tbl_rinci')
        ->where('YEAR(tbl_rinci.tgl_jual)', $tahun)
        ->select('tbl_rinci.kode_produk')
        ->select('tbl_rinci.nama_produk')
        ->select('tbl_rinci.nama_produk')
        ->select('tbl_rinci.qty')
        ->select('tbl_rinci.harga_jual')
        ->select('tbl_rinci.harga_beli')
        ->select('tbl_rinci.untung')
        ->select('tbl_rinci.total')
        ->groupBy('tbl_rinci.kode_produk')
        ->selectSum('tbl_rinci.qty')
        ->selectSum('tbl_rinci.untung')
        ->selectSum('tbl_rinci.total')
                        ->get()
                        ->getResultArray();
---
SELECT `tbl_rinci`.`kode_produk`, `tbl_rinci`.`nama_produk`, `tbl_rinci`.`nama_produk`, `tbl_rinci`.`qty`, `tbl_rinci`.`harga_jual`, `tbl_rinci`.`harga_beli`, `tbl_rinci`.`untung`, `tbl_rinci`.`total`, SUM(`tbl_rinci`.`qty`) AS `qty`, SUM(`tbl_rinci`.`untung`) AS `untung`, SUM(`tbl_rinci`.`total`) AS `total`
FROM `tbl_rinci`
WHERE YEAR(tbl_rinci.tgl_jual) = '2024'
GROUP BY `tbl_rinci`.`kode_produk`