app/Models/ModelProduk.php

SELECT COUNT(*) AS `numrows` FROM `tbl_produk`
---
    public function getProductCount()
    {
        return $this->db->table('tbl_produk')
        ->countAll();