app/Models/ModelKategori.php

    public function getProductCount()
    {
        return $this->db->table('tbl_bahan')
        ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_bahan`