app/Models/ModelTransaksi.php

    public function AllData(){
        return $this->db->table('tbl_jual')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_jual`