app/Models/ModelSatuan.php

SELECT COUNT(*) AS `numrows` FROM `tbl_satuan`
---
    public function getProductCount()
    {
        return $this->db->table('tbl_satuan')
        ->countAll();