app/Models/ModelBahan.php

SELECT COUNT(*) AS `numrows` FROM `tbl_bahan`
---
    public function getProductCount()
    {
        return $this->db->table('tbl_bahan')
        ->countAll();